Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: Add at least one recipient to send the nudge.
th_th: เพิ่มผู้รับอย่างน้อยหนึ่งรายเพื่อส่งการกระตุ้น

source: Individuals to exclude
th_th: บุคคลที่จะถูกแยกออก

source: Individuals to include
th_th: บุคคลที่จะรวมไว้

source: Upload a list of recipients
th_th: อัปโหลดรายชื่อผู้รับ

source: Build a population
th_th: สร้างกลุ่มประชากร

source: Number of recipients: {{count}}
th_th: จำนวนผู้รับ: {{count}}

source: Population setup is restricted by template creator
th_th: การตั้งค่าประชากรถูกจำกัดโดยผู้สร้างเทมเพลต

source: Remove all selections
th_th: ลบรายการที่เลือกทั้งหมด

source: Send nudge
th_th: ส่งการแจ้งเตือน

source: Are you sure you want to send the nudge to {{count}} recipient?
th_th: คุณแน่ใจหรือไม่ว่าต้องการส่งการกระตุ้นไปยังผู้รับ {{count}} คน

source: Are you sure you want to send the nudge to {{count}} recipients?
th_th: คุณแน่ใจหรือไม่ว่าต้องการส่งการกระตุ้นไปยังผู้รับ {{count}} คน

source: Supported file formats: Excel. Maximum file size: 10MB.
th_th: รูปแบบไฟล์ที่รองรับ: Excel ขนาดไฟล์สูงสุด: 10MB

source: An error occurred while validating the file. Please check the column names, the mandatory data and the file format, before trying again.
th_th: เกิดข้อผิดพลาดขณะตรวจสอบไฟล์ โปรดตรวจสอบชื่อคอลัมน์ ข้อมูลที่จำเป็น และรูปแบบไฟล์ก่อนลองอีกครั้ง

source: The file was successfully uploaded. Please download the log file.
th_th: ไฟล์ได้รับการอัปโหลดสำเร็จแล้ว โปรดดาวน์โหลดไฟล์บันทึก

source: The nudge notification was successfully sent.
th_th: ส่งการแจ้งเตือนการกระตุ้นสำเร็จแล้ว

source: Go to first page
th_th: ไปที่หน้าแรก

source: Go to {{page}} page
th_th: ไปที่หน้า {{page}}

source: Items per page
th_th: รายการต่อหน้า

source: {{firstRowPosition}} - {{lastRowPosition}} of {{totalRows}}
th_th: {{firstRowPosition}} - {{lastRowPosition}} จาก {{totalRows}}

source: Go to last page
th_th: ไปยังหน้าสุดท้าย

source: Go to next page
th_th: ไปยังหน้าถัดไป

source: Page {{page}}
th_th: หน้า {{page}}

source: Go to previous page
th_th: ไปยังหน้าก่อนหน้า

source: of
th_th: ของ

source: Multiple
th_th: หลายรายการ

source: Paragraph
th_th: ย่อหน้า

source: External
th_th: ภายนอก

source: Benchmarking
th_th: การเปรียบเทียบมาตรฐาน

source: Alert
th_th: การแจ้งเตือน

source: Manager reassigned: you
th_th: ผู้จัดการถูกมอบหมายใหม่: คุณ

source: Career development plans that were reassigned to you
th_th: แผนพัฒนาสายอาชีพที่ถูกมอบหมายให้คุณใหม่

source: You don't have any career development plans assigned.
th_th: คุณยังไม่มีแผนพัฒนาสายอาชีพที่ได้รับมอบหมาย

source: Assigned plans
th_th: แผนที่ได้รับมอบหมาย

source: No files attached
th_th: ไม่มีไฟล์แนบ

source: Your admin hasn’t added any resources yet.
th_th: ผู้ดูแลระบบของคุณยังไม่ได้เพิ่มทรัพยากรใดๆ

source: External link warning
th_th: คำเตือนเกี่ยวกับลิงก์ภายนอก

source: You’re about to visit
th_th: คุณกำลังจะเยี่ยมชม

source: Please check that this link is trustworthy before continuing.
th_th: โปรดตรวจสอบว่าลิงก์นี้น่าเชื่อถือก่อนดําเนินการต่อ

source: Access important company links and resources.
th_th: เข้าถึงลิงก์และทรัพยากรที่สำคัญของบริษัท

source: Conversation about the career development plan
th_th: การสนทนาเรื่องแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Go to check-ins
th_th: ไปที่การเช็คอิน

source: My check-ins
th_th: การเช็คอินของฉัน

source: Career development plan
th_th: แผนพัฒนาสายอาชีพ

source: Stage
th_th: ขั้นตอน

source: Save comment
th_th: บันทึกความคิดเห็น

source: No career development plans available
th_th: ไม่มีแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Are you sure you want to submit the career development plan?
th_th: คุณแน่ใจหรือไม่ว่าต้องการส่งแผนพัฒนาอาชีพ

source: Submit career development plan
th_th: ส่งแผนพัฒนาอาชีพ

source: The career development plan was successfully submitted.
th_th: แผนพัฒนาอาชีพถูกส่งเรียบร้อยแล้ว

source: Submit to manager
th_th: ส่งให้หัวหน้างาน

source: Are you sure you want to submit your career development plan to your manager?
th_th: คุณแน่ใจหรือไม่ว่าต้องการส่งแผนพัฒนาอาชีพของคุณให้กับผู้จัดการของคุณ

source: Go to goals
th_th: ไปที่เป้าหมาย

source: Plan category
th_th: ประเภทแผน

source: My plans
th_th: แผนของฉัน

source: View & manage my career plans
th_th: ดูและจัดการแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: My career plans
th_th: แผนอาชีพของฉัน

source: Manager reassigned: {{managerName}}
th_th: มีการมอบหมายผู้จัดการใหม่: {{managerName}}

source: Track your personal career development progress
th_th: ติดตามความคืบหน้าการพัฒนาสายอาชีพส่วนบุคคลของคุณ

source: You don't have any career development plans yet
th_th: คุณยังไม่มีแผนพัฒนาสายอาชีพเลย

source: No plans match your search
th_th: ไม่พบแผนที่ตรงกับการค้นหาของคุณ

source: My career development plans
th_th: แผนพัฒนาสายอาชีพของฉัน

source: Career development plan name
th_th: ชื่อแผนพัฒนาสายอาชีพ

source: Your admin hasn't added any questions yet.
th_th: ผู้ดูแลระบบของคุณยังไม่ได้เพิ่มคำถามใดๆ

source: No questions available
th_th: ไม่มีคำถามใดๆ

source: Share your thoughts
th_th: แบ่งปันความคิดของคุณ

source: The worker will answer this question
th_th: พนักงานจะตอบคำถามนี้

source: Edit to add your answer
th_th: แก้ไขเพื่อเพิ่มคำตอบของคุณ

source: Manager response pending
th_th: กำลังรอผู้จัดการตอบกลับ

source: No inputs provided
th_th: ไม่ได้ระบุข้อมูลนำเข้า

source: Worker response pending
th_th: กำลังรอคำตอบจากพนักงาน

source: Career development questionnaire
th_th: แบบสอบถามความก้าวหน้าในสายอาชีพ

source: Add skills to career development plan
th_th: เพิ่มทักษะให้กับแผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Skill & competency groups
th_th: กลุ่มทักษะและความสามารถ

source: Enhance your profile by adding and rating your skills
th_th: ปรับปรุงโปรไฟล์ของคุณโดยการเพิ่มและให้คะแนนทักษะของคุณ

source: Add your skills
th_th: เพิ่มทักษะของคุณ

source: Search by skill name
th_th: ค้นหาตามชื่อทักษะ

source: Skill & category
th_th: ทักษะและหมวดหมู่

source: Manager evaluation
th_th: การประเมินผู้จัดการ

source: Select skill level
th_th: เลือกระดับทักษะ

source: Worker self-rating
th_th: การประเมินตนเองของพนักงาน

source: No manager rating was provided
th_th: ไม่ได้ให้คะแนนผู้จัดการ

source: Pending manager review
th_th: รอการประเมินผลงานจากหัวหน้างาน

source: No self-rating was provided
th_th: ไม่ได้ให้คะแนนตนเอง

source: Pending worker review
th_th: กำลังรอการประเมินผลงานของพนักงาน

source: You cannot submit responses for this career development plan. If you wish to reconsider, please contact your manager.
th_th: คุณไม่สามารถส่งคำตอบสำหรับแผนพัฒนาสายอาชีพนี้ได้ หากคุณต้องการพิจารณาใหม่ กรุณาติดต่อผู้จัดการของคุณ

source: You have opted out of the career development plan.
th_th: คุณได้เลือกที่จะไม่เข้าร่วมแผนพัฒนาสายอาชีพ

source: Worker refusal & submission
th_th: การปฏิเสธและการส่งงานของพนักงาน

source: The worker has already submitted their inputs. You cannot mark the process as "Rejected by the worker".
th_th: พนักงานได้ส่งข้อมูลของตนเองเรียบร้อยแล้ว ท่านไม่สามารถทำเครื่องหมายกระบวนการว่า "ถูกปฏิเสธโดยพนักงาน" ได้

source: Career development plan refused by worker
th_th: แผนพัฒนาสายอาชีพถูกปฏิเสธโดยพนักงาน

source: Are you sure you want to confirm that the worker has refused to participate in the career development plan? Once confirmed, the worker will not be able to provide responses or submit the form.
th_th: คุณแน่ใจหรือไม่ว่าต้องการยืนยันว่าพนักงานได้ปฏิเสธที่จะเข้าร่วมแผนพัฒนาสายอาชีพ? เมื่อยืนยันแล้ว พนักงานจะไม่สามารถให้คำตอบหรือส่งแบบฟอร์มได้

source: Confirm career development plan refusal
th_th: ยืนยันการปฏิเสธแผนพัฒนาสายอาชีพ

source: You can still add comments in the sections. Once you have completed your review, please submit the form to finalize the process.
th_th: ท่านยังสามารถเพิ่มความคิดเห็นในแต่ละส่วนได้ เมื่อท่านตรวจสอบเสร็จสิ้นแล้ว กรุณาส่งแบบฟอร์มเพื่อดำเนินการให้เสร็จสมบูรณ์

source: The worker has opted out of the career development plan.
th_th: พนักงานได้เลือกที่จะไม่เข้าร่วมแผนพัฒนาสายอาชีพ

source: Are you sure you want to confirm the worker’s decision to participate in the career development plan? Once confirmed, the worker will be able to provide responses or submit the form.
th_th: คุณแน่ใจหรือไม่ว่าต้องการยืนยันการตัดสินใจของพนักงานในการเข้าร่วมแผนพัฒนาสายอาชีพ? เมื่อยืนยันแล้ว พนักงานจะสามารถให้คำตอบหรือส่งแบบฟอร์มได้

source: Confirm reopening of the career development plan
th_th: ยืนยันการเปิดแผนพัฒนาสายอาชีพอีกครั้ง

source: {{step}} (refused)
th_th: {{step}} (ถูกปฏิเสธ)

source: Check-in category
th_th: หมวดหมู่การเช็คอิน

source: Make the most of your check-ins!
th_th: ใช้ประโยชน์สูงสุดจากการเช็กอินของคุณ!

source: No upcoming check-ins
th_th: ไม่มีการเช็กอินที่กำลังจะมาถึง

source: Set a date for the following check-ins
th_th: กำหนดวันที่สำหรับการเช็กอินถัดไป

source: No results. Please try adjusting your filters or clearing some criteria to see results.
th_th: ไม่พบผลลัพธ์ กรุณาปรับตัวกรองหรือเคลียร์บางเงื่อนไขเพื่อดูผลลัพธ์

source: You haven’t created any check-ins yet. Start your journey towards growth by creating your first check-in
th_th: คุณยังไม่ได้สร้างการเช็กอินใด ๆ เลย เริ่มต้นเส้นทางสู่การเติบโตของคุณด้วยการสร้างการเช็กอินครั้งแรก

source: Actions required
th_th: ต้องดำเนินการ

source: No results.<br/>Clear the search to show all results.
th_th: ไม่มีผลลัพธ์ <br/> ล้างการค้นหาเพื่อแสดงผลลัพธ์ทั้งหมด

source: You don’t have any goals yet. Kickstart your progress by setting your first goal!
th_th: คุณยังไม่มีเป้าหมายใดๆ เริ่มต้นโดยกำหนดเป้าหมายแรกของคุณ!

source: This worker has no goals yet. Create goals to help their progress.
th_th: พนักงานคนนี้ยังไม่มีเป้าหมาย สร้างเป้าหมายเพื่อช่วยให้พวกเขาก้าวหน้า

source: Go to the Check-ins page to take any required actions
th_th: ไปที่หน้าตรวจสอบเพื่อดำเนินการที่จำเป็น

source: Events history
th_th: ประวัติเหตุการณ์

source: No compensation data to display
th_th: ไม่มีข้อมูลค่าตอบแทนที่จะแสดง

source: Hide sensitive data
th_th: ซ่อนข้อมูลที่ละเอียดอ่อน

source: Sensitive data is hidden
th_th: ข้อมูลที่ละเอียดอ่อนถูกซ่อนไว้

source: Salary change events – Last 5 years
th_th: เหตุการณ์การเปลี่ยนแปลงเงินเดือน – 5 ปีที่ผ่านมา

source: Historical compensation
th_th: ค่าชดเชยย้อนหลัง

source: Overview of recent salary changes
th_th: ภาพรวมของการเปลี่ยนแปลงเงินเดือนล่าสุด

source: Last request
th_th: คำขอล่าสุด

source: Request date
th_th: วันที่ส่งคำขอ

source: Request pay information
th_th: ขอข้อมูลการจ่ายเงิน

source: Enter your description here
th_th: ป้อนคำอธิบายของคุณที่นี่

source: Pay information
th_th: ข้อมูลการจ่ายเงิน

source: You cannot submit a new pay information request as you already have a request in progress.
th_th: คุณไม่สามารถส่งคำขอข้อมูลค่าจ้างใหม่ได้ เนื่องจากคุณมีคำขอที่กำลังดำเนินการอยู่แล้ว

source: Request in progress
th_th: คำขออยู่ระหว่างดำเนินการ

source: The request was successfully created.
th_th: สร้างคำขอสำเร็จแล้ว

source: Midpoint
th_th: ค่ากลาง

source: No position in pay range data to display
th_th: ไม่มีข้อมูลตำแหน่งในช่วงเงินเดือนที่จะแสดง

source: Use this toggle to hide or show your sensitive compensation information.
th_th: ใช้สวิตช์นี้เพื่อซ่อนหรือแสดงข้อมูลค่าตอบแทนที่เป็นความลับของคุณ

source: Show sensitive data
th_th: แสดงข้อมูลที่ละเอียดอ่อน

source: Sensitive data is displayed
th_th: มีการแสดงข้อมูลที่ละเอียดอ่อน

source: Total direct compensation
th_th: ค่าตอบแทนโดยตรงทั้งหมด

source: Total indirect compensation
th_th: ค่าตอบแทนทางอ้อมทั้งหมด

source: Variable bonus
th_th: โบนัสผันแปร

source: Cost center name
th_th: ชื่อศูนย์ต้นทุน

source: Education
th_th: การศึกษา

source: General information
th_th: ข้อมูลทั่วไป

source: Hide worker details
th_th: ซ่อนรายละเอียดของพนักงาน

source: Role information
th_th: ข้อมูลบทบาท

source: Show worker details
th_th: แสดงรายละเอียดของพนักงาน

source: Start date in role
th_th: วันที่เริ่มต้นในบทบาท

source: Tenure
th_th: ระยะเวลาการดำรงตำแหน่ง

source: Worker information
th_th: ข้อมูลพนักงาน

source: Work city
th_th: เมืองที่ทำงาน

source: No documents yet. Your most recent documents will be displayed here for easy access.
th_th: ยังไม่มีเอกสาร เอกสารล่าสุดของคุณจะแสดงที่นี่เพื่อให้เข้าถึงได้ง่าย

source: Latest documents
th_th: เอกสารล่าสุด

source: Date generated
th_th: วันที่สร้าง

source: Tag
th_th: แท็ก

source: All documents you have received
th_th: เอกสารทั้งหมดที่คุณได้รับ

source: You don't have enough information to review yet.
th_th: คุณยังไม่มีข้อมูลเพียงพอสำหรับการตรวจสอบในขณะนี้

source: Variable achievement estimator
th_th: ตัวประมาณค่าความสำเร็จแบบตัวแปร

source: Use our model for inspiration
th_th: ใช้โมเดลของเราเพื่อเป็นแรงบันดาลใจ

source: Your feedback activity will be displayed here. Start by sharing your thoughts and suggestions with your colleagues.
th_th: กิจกรรมฟีดแบคของคุณจะแสดงที่นี่ เริ่มต้นด้วยการแบ่งปันความคิดและฟีดแบคของคุณกับเพื่อนร่วมงาน

source: Feedback category
th_th: หมวดหมู่ข้อเสนอแนะ

source: Feedback notes are for your personal use; only you can view them. Start adding your notes here to keep track of your progress and ideas.
th_th: บันทึกฟีดแบคมีไว้สำหรับการใช้งานส่วนบุคคลของคุณเท่านั้น คุณเท่านั้นที่สามารถดูได้ เริ่มเพิ่มหมายเหตุของคุณที่นี่เพื่อติดตามความคืบหน้าและแนวคิดของคุณ

source: Add your notes here to keep track of your progress and ideas. Feedback notes are for your personal use; only you can view them.
th_th: เพิ่มหมายเหตุของคุณที่นี่เพื่อติดตามความคืบหน้าและแนวคิดของคุณ บันทึกฟีดแบคมีไว้สำหรับการใช้งานส่วนบุคคลของคุณ คุณเท่านั้นที่สามารถดูได้

source: Feedback overview
th_th: ภาพรวมฟีดแบค

source: Here you will see feedback marked as a public. Check again later for updates or be the first to give public feedback to a colleague.
th_th: ที่นี่คุณจะเห็นฟีดแบคที่ทำเครื่องหมายว่าเป็นสาธารณะ ตรวจสอบอีกครั้งในภายหลังเพื่อรับการอัปเดตหรือเป็นคนแรกที่ให้ฟีดแบคสาธารณะแก่เพื่อนร่วมงาน

source: Here you will see feedback marked as a public. Check again later for updates or explore more features in the meantime.
th_th: ที่นี่คุณจะเห็นฟีดแบคที่ทำเครื่องหมายว่าเป็นสาธารณะ โปรดตรวจสอบอีกครั้งในภายหลังเพื่อดูการอัปเดตหรือสำรวจคุณสมบัติเพิ่มเติมในระหว่างนี้

source: Feedback from your colleagues will appear here. Check again later for updates or explore more features in the meantime.
th_th: ฟีดแบคจากเพื่อนร่วมงานของคุณจะปรากฏที่นี่ ตรวจสอบอีกครั้งในภายหลังเพื่อดูการอัปเดตหรือสำรวจคุณสมบัติเพิ่มเติมในระหว่างนี้

source: Reach out to your team and request their thoughts on your work.
th_th: ติดต่อทีมงานของคุณและขอความคิดเห็นของพวกเขาเกี่ยวกับงานของคุณ

source: New feedback
th_th: ฟีดแบคใหม่

source: Your received feedback volume is up!
th_th: จำนวนฟีดแบคที่คุณได้รับเพิ่มขึ้นแล้ว!

source: Requested feedback will appear here. Start by reaching out to your team and requesting their input on your work.
th_th: ฟีดแบคที่ร้องขอจะปรากฏที่นี่ เริ่มต้นด้วยการติดต่อทีมงานของคุณและขอความคิดเห็นจากพวกเขาเกี่ยวกับงานของคุณ

source: Request feedback and find out what your colleagues think about your collaboration.
th_th: ขอรับความคิดเห็นและค้นหาว่าเพื่อนร่วมงานของคุณคิดอย่างไรเกี่ยวกับการทำงานร่วมกันของคุณ

source: Feedback requests from your colleagues will appear here. In the meantime, you can send a feedback request to your colleagues to get the conversation started.
th_th: คำขอฟีดแบคจากเพื่อนร่วมงานของคุณจะปรากฏที่นี่ ในระหว่างนี้ คุณสามารถส่งคำขอฟีดแบคไปยังเพื่อนร่วมงานเพื่อเริ่มการสนทนาได้

source: New request
th_th: คำขอใหม่

source: Feedback helps improve teamwork and processes within the company. Start sharing your thoughts and suggestions with your colleagues.
th_th: ฟีดแบคช่วยปรับปรุงการทำงานเป็นทีมและกระบวนการต่างๆ ภายในบริษัท เริ่มแบ่งปันความคิดและฟีดแบคของคุณกับเพื่อนร่วมงาน

source: Your colleagues are waiting for your feedback. Start sharing your insights with them.
th_th: เพื่อนร่วมงานของคุณกำลังรอฟีดแบคจากคุณอยู่ เริ่มแบ่งปันข้อมูลเชิงลึกของคุณกับพวกเขาได้เลย

source: Feedback helps improve teamwork and processes within the company. Start by sharing your thoughts and suggestions with your colleagues.
th_th: ฟีดแบคช่วยปรับปรุงการทำงานเป็นทีมและกระบวนการต่างๆ ภายในบริษัท เริ่มต้นด้วยการแบ่งปันความคิดและฟีดแบคของคุณกับเพื่อนร่วมงาน

source: Team feedback requests
th_th: คำขอฟีดแบคจากทีมงาน

source: Feedback requests about your colleagues will appear here. In the meantime, you can send a feedback request to your colleagues to get the conversation started.
th_th: คำขอฟีดแบคเกี่ยวกับเพื่อนร่วมงานของคุณจะปรากฏที่นี่ ในระหว่างนี้ คุณสามารถส่งคำขอฟีดแบคไปยังเพื่อนร่วมงานเพื่อเริ่มการสนทนาได้

source: Hide confidential information
th_th: ซ่อนข้อมูลที่เป็นความลับ

source: Thank you. We'll inform {{givenName}} that you would like to discuss your equity compensation in more detail.
th_th: ขอขอบคุณ เราจะแจ้งให้ {{givenName}} ทราบว่าคุณต้องการหารือเกี่ยวกับผลตอบแทนหุ้นของคุณโดยละเอียดมากขึ้น

source: My documents
th_th: เอกสารของฉัน

source: We don’t have enough data to display your behavior wheel yet. Request feedback from your colleagues to start building a complete picture of your performance.
th_th: เรายังไม่มีข้อมูลเพียงพอที่จะแสดงวงล้อพฤติกรรมของคุณ ขอฟีดแบคจากเพื่อนร่วมงานของคุณเพื่อเริ่มสร้างภาพรวมของประสิทธิภาพการทำงานของคุณ

source: There aren’t enough data to display the behavior wheel.
th_th: ไม่มีข้อมูลเพียงพอที่จะแสดงวงล้อพฤติกรรม

source: View behaviors
th_th: ดูพฤติกรรม

source: View my received feedback
th_th: ดูฟีดแบคที่ฉันได้รับ

source: Explore the feedback you received and highlight the ones that inspire you the most!
th_th: สำรวจฟีดแบคที่คุณได้รับและเน้นย้ำถึงสิ่งที่สร้างแรงบันดาลใจให้กับคุณมากที่สุด!

source: You haven’t marked any feedback as favorites yet. Explore the feedback you received and highlight the ones that inspire you the most!
th_th: คุณยังไม่ได้ทำเครื่องหมายฟีดแบคใดเป็นรายการโปรด ดูฟีดแบคที่คุณได้รับและให้ความสำคัญกับฟีดแบคที่สร้างแรงบันดาลใจให้กับคุณมากที่สุด!

source: Go to feedback
th_th: ไปที่ฟีดแบค

source: Your favorite received feedback
th_th: รายการโปรดฟีดแบคที่ได้รับ

source: Go to documents
th_th: ไปที่เอกสาร

source: You don’t have any goal plans yet.
th_th: คุณยังไม่มีแผนเป้าหมายใดๆ

source: Your individual goals
th_th: เป้าหมายรายบุคคลของคุณ

source: Personal information
th_th: ข้อมูลส่วนบุคคล

source: Org level 1
th_th: ฝ่าย

source: View profile
th_th: ดูโปรไฟล์

source: Organization goals
th_th: เป้าหมายขององค์กร

source: Payee
th_th: ผู้รับชำระ

source: No performance reviews are assigned to you at the moment.
th_th: ไม่มีการมอบหมายการประเมินผลการปฏิบัติงานให้กับคุณในขณะนี้

source: Assigned reviews
th_th: การตรวจสอบที่ได้รับมอบหมาย

source: Review category
th_th: หมวดหมู่การตรวจสอบ

source: No ratings yet
th_th: ยังไม่มีการให้คะแนน

source: List of performance reviews & ratings
th_th: รายการประเมินผลงานและผลการปฏิบัติงาน

source: Enable 360 reviews
th_th: เปิดใช้งานการประเมินผลงาน 360 องศา

source: Check the widgets you want visible on the passport page.
th_th: ตรวจสอบวิดเจ็ตที่คุณต้องการให้ปรากฏบนหน้าหนังสือเดินทาง

source: Passport widget settings
th_th: การตั้งค่าวิดเจ็ตหนังสือเดินทาง

source: Digital reward statement
th_th: ใบแจ้งยอดรางวัลดิจิทัล

source: Enable my total compensation
th_th: เปิดใช้งานผลตอบแทนรวมของฉัน

source: Enable and configure the digital reward statement.
th_th: เปิดใช้งานและกำหนดค่ารายงานรางวัลดิจิทัล

source: The section header cannot be empty.
th_th: ส่วนหัวของส่วนนี้ไม่สามารถเว้นว่างได้

source: Preview compensation breakdown in the digital reward statement page.
th_th: ดูตัวอย่างรายละเอียดค่าตอบแทนในหน้ารายงานรางวัลดิจิทัล

source: Compensation breakdown
th_th: รายละเอียดค่าตอบแทน

source: Select the compensation elements to display in the history
th_th: เลือกองค์ประกอบค่าตอบแทนที่จะแสดงในประวัติ

source: Choose elements
th_th: เลือกองค์ประกอบ

source: Compensation elements
th_th: องค์ประกอบค่าตอบแทน

source: At least one compensation element must be selected.
th_th: ต้องเลือกองค์ประกอบค่าตอบแทนอย่างน้อยหนึ่งรายการ

source: Number of years
th_th: จำนวนปี

source: The number of years must be at least 1.
th_th: จำนวนปีต้องมีอย่างน้อย 1

source: The number of years cannot be empty.
th_th: จำนวนปีไม่สามารถเว้นว่างได้

source: Preview historical compensation
th_th: ดูตัวอย่างประวัติค่าตอบแทน

source: Show total compensation
th_th: แสดงค่าตอบแทนรวม

source: Preview compensation numerical overview
th_th: ดูตัวอย่างภาพรวมค่าตอบแทนเป็นตัวเลข

source: Compensation in numbers
th_th: ค่าตอบแทนในตัวเลข

source: Show total direct compensation
th_th: แสดงค่าตอบแทนทางตรงรวม

source: Show total indirect compensation
th_th: แสดงค่าตอบแทนทางอ้อมรวม

source: At least one compensation widget must be selected.
th_th: ต้องเลือกวิดเจ็ตค่าตอบแทนอย่างน้อยหนึ่งรายการ

source: Compensation philosophy description
th_th: คำอธิบายปรัชญาการให้ค่าตอบแทน

source: Enter text
th_th: กรอกข้อความ

source: The description is required.
th_th: จำเป็นต้องระบุคำอธิบาย

source: The header is required.
th_th: ต้องระบุส่วนหัว

source: Use this section to communicate your company’s guiding principles on pay and rewards.
th_th: ใช้ส่วนนี้เพื่อสื่อสารหลักการสำคัญของบริษัทเกี่ยวกับค่าตอบแทนและรางวัล

source: Compensation philosophy
th_th: ปรัชญาการให้ค่าตอบแทน

source: Main content
th_th: เนื้อหาหลัก

source: Our compensation philosophy
th_th: ปรัชญาการให้ค่าตอบแทนของเรา

source: Allow pay information requests
th_th: อนุญาตให้ขอข้อมูลการจ่ายเงิน

source: Include the ability to request pay information.
th_th: รวมความสามารถในการขอข้อมูลเงินเดือน

source: The ray information text cannot be empty.
th_th: ข้อความข้อมูลค่าตอบแทนไม่สามารถเว้นว่างได้

source: Preview position in pay range in the digital reward statement page
th_th: ดูตัวอย่างตำแหน่งในช่วงเงินเดือนในหน้ารายงานรางวัลดิจิทัล

source: Position in pay range
th_th: ตำแหน่งในช่วงเงินเดือน

source: Position in pay range toggle
th_th: สวิตช์ตำแหน่งในช่วงเงินเดือน

source: Compensation policy link description
th_th: คำอธิบายลิงก์นโยบายค่าตอบแทน

source: The label is required.
th_th: จำเป็นต้องระบุป้ายกำกับ

source: Please enter a valid URL
th_th: กรุณากรอก URL ที่ถูกต้อง

source: The link is required.
th_th: จำเป็นต้องมีลิงก์

source: Show compensation policy link
th_th: แสดงลิงก์นโยบายค่าตอบแทน

source: Add resource
th_th: เพิ่มทรัพยากร

source: List of resources
th_th: รายการทรัพยากร

source: Enter your resource label here
th_th: ป้อนป้ายกำกับทรัพยากรของคุณที่นี่

source: The resource label cannot be empty.
th_th: ป้ายกำกับทรัพยากรไม่สามารถเว้นว่างได้

source: The resource link must be a valid URL.
th_th: ลิงก์ทรัพยากรต้องเป็น URL ที่ถูกต้อง

source: The resource link cannot be empty.
th_th: ลิงก์ทรัพยากรไม่สามารถเว้นว่างได้

source: Provide links to the digital reward statement page.
th_th: โปรดให้ลิงก์ไปยังหน้ารายการรางวัลดิจิทัล

source: Section description
th_th: คำอธิบายส่วน

source: Section header
th_th: หัวข้อส่วน

source: Side panel
th_th: แถบด้านข้าง

source: The digital reward statement was successfully updated.
th_th: อัปเดตใบแจ้งรางวัลดิจิทัลเรียบร้อยแล้ว

source: Edit digital reward statement
th_th: แก้ไขข้อความแถลงรางวัลดิจิทัล

source: Enable learning
th_th: เปิดใช้งานการเรียนรู้

source: Goal overall progress
th_th: ความคืบหน้าโดยรวมของเป้าหมาย

source: Enable reviews
th_th: เปิดใช้งานการประเมินผลงาน

source: Show confidential information
th_th: แสดงข้อมูลที่เป็นความลับ

source: Chat
th_th: แชต

source: No comments yet
th_th: ยังไม่มีความคิดเห็น

source: Check-in comments
th_th: ความคิดเห็นการเช็กอิน

source: Goal comments
th_th: ความคิดเห็นเกี่ยวกับเป้าหมาย

source: Due date: {{date}}
th_th: กำหนดส่ง: {{date}}

source: Questionnaire comments
th_th: ความคิดเห็นแบบสอบถาม

source: No questions
th_th: ไม่มีคำถาม

source: Skill comments
th_th: ความคิดเห็นเกี่ยวกับทักษะ

source: Worker’s self-rating
th_th: การให้คะแนนตนเองของพนักงาน

source: No skills yet
th_th: ยังไม่มีทักษะ

source: Manager’s evaluation
th_th: การประเมินของผู้จัดการ

source: No rating provided
th_th: ยังไม่ได้ให้คะแนน

source: Type: {{name}}
th_th: ประเภท: {{name}}

source: Closed date
th_th: วันที่ปิด

source: Close date
th_th: วันที่ปิด

source: The worker has opted out of the career development plan
th_th: พนักงานได้เลือกที่จะไม่เข้าร่วมแผนพัฒนาสายอาชีพ
